#+TITLE: Clean and Organize Africa FAO Data for pSIMS

#+PROPERTY: session *R*
#+PROPERTY: results silent

** Make a list of the =.RData= files that we downloaded

The download was done by hand from [[www.gadm.org]].  The =.RData= files
have the place names properly encoded with diacritical marks and
alternate spellings.

#+BEGIN_SRC R
gadmFiles <- list.files(
  path= "Shapefiles/R Data",
  recursive= TRUE,
  full.names= TRUE)
#+END_SRC

Here are the files:

#+BEGIN_SRC R :tangle no :results replace 
  gadmFiles
#+END_SRC

#+RESULTS:
| Shapefiles/R Data/Angola/AGO_adm1.RData                      |
| Shapefiles/R Data/Benin/BEN_adm1.RData                       |
| Shapefiles/R Data/Burkina Faso/BFA_adm1.RData                |
| Shapefiles/R Data/Burkina Faso/BFA_adm2.RData                |
| Shapefiles/R Data/Burundi/BDI_adm1.RData                     |
| Shapefiles/R Data/Cameroon/CMR_adm1.RData                    |
| Shapefiles/R Data/Côte d'Ivoire/CIV_adm1.RData               |
| Shapefiles/R Data/Ethiopia/ETH_adm1.RData                    |
| Shapefiles/R Data/Gambia/GMB_adm1.RData                      |
| Shapefiles/R Data/Ghana/GHA_adm1.RData                       |
| Shapefiles/R Data/Guinea-Bissau/GNB_adm1.RData               |
| Shapefiles/R Data/Kenya/KEN_adm1.RData                       |
| Shapefiles/R Data/Malawi/MWI_adm1.RData                      |
| Shapefiles/R Data/Mali/MLI_adm1.RData                        |
| Shapefiles/R Data/Mozambique/MOZ_adm1.RData                  |
| Shapefiles/R Data/Niger/NER_adm1.RData                       |
| Shapefiles/R Data/Nigeria/NGA_adm1.RData                     |
| Shapefiles/R Data/Rwanda/RWA_adm1.RData                      |
| Shapefiles/R Data/Rwanda/RWA_adm2.RData                      |
| Shapefiles/R Data/Togo/TGO_adm1.RData                        |
| Shapefiles/R Data/United Republic of Tanzania/TZA_adm1.RData |
| Shapefiles/R Data/Zambia/ZMB_adm1.RData                      |


*** Count the Malawi records

#+BEGIN_SRC R :results replace
  nrow( gadmNames[ gadmNames$ISO == "MWI", ])
#+END_SRC

#+RESULTS:
: 3402


*** Count the Malawi records with alternate names for level 1


#+BEGIN_SRC R :results replace
    nrow( gadmNames[ gadmNames$ISO == "MWI"
                    & is.na( gadmNames$NAME_2)
                    & gadmNames$VARNAME != "", ])
#+END_SRC

#+RESULTS:
: 11

*** Count the Malawi records with alternate names for level 2


#+BEGIN_SRC R :results replace
    nrow( gadmNames[ gadmNames$ISO == "MWI"
                    & is.na( gadmNames$NAME_3)
                    & gadmNames$VARNAME != "", ])
#+END_SRC

#+RESULTS:
: 11




